#### Terraform working directory 🏠: `demo/demo-account/demo-application/resources`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ebs_volumes.module.ebs_volume["ansible-testhost5/sdg"].aws_ebs_volume.this will be destroyed
  # (because module.ebs_volumes.module.ebs_volume["ansible-testhost5/sdg"] is not in configuration)
  - resource "aws_ebs_volume" "this" {
      - arn                  = "arn:aws:ec2:ap-southeast-1:129980683758:volume/vol-0ac56e6538b2c01b2" -> null
      - availability_zone    = "ap-southeast-1a" -> null
      - encrypted            = true -> null
      - final_snapshot       = false -> null
      - id                   = "vol-0ac56e6538b2c01b2" -> null
      - iops                 = 3000 -> null
      - kms_key_id           = "arn:aws:kms:ap-southeast-1:129980683758:key/6dc66ab3-fb16-4eb2-8a7a-5be1bee5e2ee" -> null
      - multi_attach_enabled = false -> null
      - size                 = 40 -> null
      - tags                 = {
          - "Name" = "ansible-testhost5/sdg"
        } -> null
      - tags_all             = {
          - "Name" = "ansible-testhost5/sdg"
        } -> null
      - throughput           = 125 -> null
      - type                 = "gp3" -> null
    }

  # module.ebs_volumes.module.ebs_volume["test-host/sdg"].aws_ebs_volume.this will be created
  + resource "aws_ebs_volume" "this" {
      + arn               = (known after apply)
      + availability_zone = "ap-southeast-1a"
      + encrypted         = true
      + final_snapshot    = false
      + id                = (known after apply)
      + iops              = (known after apply)
      + kms_key_id        = (known after apply)
      + size              = 40
      + snapshot_id       = (known after apply)
      + tags              = {
          + "Name" = "test-host/sdg"
        }
      + tags_all          = {
          + "Name" = "test-host/sdg"
        }
      + throughput        = (known after apply)
      + type              = "gp3"
    }

  # module.ebs_volumes.module.ebs_volume["test-host/sdg"].aws_volume_attachment.this[0] will be created
  + resource "aws_volume_attachment" "this" {
      + device_name = "sdg"
      + id          = (known after apply)
      + instance_id = "i-017a8402c5251ed5a"
      + volume_id   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
